src/InformationRegisters/ПараметрыКластеровКеш/ПараметрыКластеровКеш.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКластеровКеш</name>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокРабочиеСерверы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыКластеровКеш/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПрочитатьНастройки(ОбъектКонтроля) Экспорт
    
    ТекДата = ТекущаяДата();
    ВремяАктуальностиКеша = Константы.Кластер1СВремяАктуальностиКеша.Получить();
    Если НЕ ЗначениеЗаполнено(ВремяАктуальностиКеша) Тогда
        ВремяАктуальностиКеша = 600;
    КонецЕсли;
        
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ОбъектКонтроля = ОбъектКонтроля;
    МенеджерЗаписи.Прочитать();
        
    Настройки = Новый Структура("ИдентификаторКластера, СписокИБ, СписокРабочиеСерверы", Неопределено, Неопределено, Неопределено);
    Если МенеджерЗаписи.ДатаЗаписи + ВремяАктуальностиКеша > ТекДата Тогда
        Настройки.ИдентификаторКластера = МенеджерЗаписи.ИдентификаторКластера;
        Настройки.СписокИБ = МенеджерЗаписи.СписокИБ.Получить();
        Настройки.СписокРабочиеСерверы = МенеджерЗаписи.СписокРабочиеСерверы.Получить();
    КонецЕсли;
            
    Возврат Настройки;
    
КонецФункции

// Записать настройки
//
// Параметры:
//  ОбъектКонтроля - СправочникСсылка.ОбъектыКонтроля - кластер 1С для которого записываются настройки.
//  Настройки      - Структура - структура создания:
//
Процедура ЗаписатьНастройки(ОбъектКонтроля, Настройки) Экспорт
    
    ТекДата = ТекущаяДата();
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ОбъектКонтроля = ОбъектКонтроля;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.ОбъектКонтроля = ОбъектКонтроля;
    МенеджерЗаписи.ДатаЗаписи = ТекДата;
    
    Если Настройки.Свойство("ИдентификаторКластера") Тогда
        МенеджерЗаписи.ИдентификаторКластера = Настройки.ИдентификаторКластера;
    КонецЕсли;
    
    Если Настройки.Свойство("СписокИБ") Тогда
        МенеджерЗаписи.СписокИБ = Новый ХранилищеЗначения(Настройки.СписокИБ);
    КонецЕсли;
    
    Если Настройки.Свойство("СписокРабочиеСерверы") Тогда
        МенеджерЗаписи.СписокРабочиеСерверы = Новый ХранилищеЗначения(Настройки.СписокРабочиеСерверы);
    КонецЕсли;
    
    МенеджерЗаписи.Записать(Истина);
    
КонецПроцедуры

Процедура ОчиститьКеш(ОбъектКонтроля) Экспорт
    
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ОбъектКонтроля = ОбъектКонтроля;
    МенеджерЗаписи.Удалить();
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
